app/views/companies/export.csv.erb

<% for company_user in @company_users %>
<%= "#{company_user.user.id.format_csv},#{company_user.user.username.format_csv},#{company_user.user.email.format_csv},#{company_user.user.first_name.format_csv},#{company_user.user.last_name.format_csv},#{company_user.user.created_at.format_csv},#{company_user.user.updated_at.format_csv}" %>
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1