app/controllers/companies_controller.rb

  def export
    @company = Company.find(params[:id])
    @customers = @company.get_customers()
    @divisions = @company.get_report_divisions()
    @locations = @company.get_report_locations()
    @products_categories = ProductsCategory.find(:all, :conditions => {:company_id => @company.id})
    @products = Product.find(:all, :conditions => {:company_id => @company.id})
    @suppliers = Supplier.find(:all, :conditions => {:company_id => @company.id})
    @products_kits = ProductsKit.find(:all, :conditions => {:company_id => @company.id})
    @invoices = Invoice.find(:all, :conditions => {:company_id => @company.id})
    @company_users = CompanyUser.find(:all, :conditions => {:company_id => @company.id})
---
SELECT `companies`.* FROM `companies` WHERE `companies`.`id` = 1 LIMIT 1
SELECT `customers`.* FROM `customers` WHERE `customers`.`company_id` = 1
SELECT `divisions`.* FROM `divisions` WHERE `divisions`.`company_id` = 1
SELECT `locations`.* FROM `locations` WHERE `locations`.`company_id` = 1
SELECT `products_categories`.* FROM `products_categories` WHERE `products_categories`.`company_id` = 1
SELECT `products`.* FROM `products` WHERE `products`.`company_id` = 1
SELECT `suppliers`.* FROM `suppliers` WHERE `suppliers`.`company_id` = 1
SELECT `products_kits`.* FROM `products_kits` WHERE `products_kits`.`company_id` = 1
SELECT `invoices`.* FROM `invoices` WHERE `invoices`.`company_id` = 1
SELECT `company_users`.* FROM `company_users` WHERE `company_users`.`company_id` = 1
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1

  def index
    @pagetitle = 'My companies'
    @companies = getUser().get_companies()
    @user_package = UsersPackage.find(:first, :conditions => {:user_id => getUserId()})
---
SELECT `users_packages`.* FROM `users_packages` WHERE `users_packages`.`user_id` = 1 LIMIT 1

  def show
    @company = Company.find(params[:id])
    set_company(@company)

    @pagetitle = @company[:name]
    @locations = Location.find(:all, :conditions => {:company_id => @company.id})
---
SELECT `companies`.* FROM `companies` WHERE `companies`.`id` = 1 LIMIT 1
SELECT `locations`.* FROM `locations` WHERE `locations`.`company_id` = 1

  def create
    @pagetitle = 'New company'
    @company = Company.new(params[:company])
    @company[:user_id] = getUserId()

    @companies_left_i = getUser().companies_left
    @companies_left = getUser().print_companies_left
    @companies_left_class = getUser().companies_left_class

    # Check package limits
    if(@companies_left_i <= 0 and @companies_left_i > -1000)
      flash[:error] = "You have created the most companies you can within your package.  Please select another package to create more companies."
      redirect_to("/pricing")
    else
      respond_to do |format|
        # Should we upload a logo?
        if(params[:company][:logo])
          if(not checkFileExtension(params[:company][:logo], imgTypes()))
            flash[:error] = "The logo you tried to upload doesn't have the correct format.  Please upload a GIF, JPG, or PNG image."
            format.html { render :action => "edit" }
          else
            params[:company][:logo] = @company.upload_logo(params[:company][:logo])
          end
        end

        if @company.save
          # Create company user for the user
          new_company_user = CompanyUser.new(:company_id => @company.id, :user_id => getUserId())
          new_company_user.save
---
INSERT INTO `companies` (`phone2`, `name`, `created_at`, `website`, `zip`, `email`, `user_id`, `logo`, `address2`, `phone1`, `updated_at`, `country`, `address1`, `city`, `state`) VALUES ('', 'FrenoSeguro', '2011-10-28 15:40:15', 'http://www.frenoseguro.com/', '5934', 'agenciatancamarengo@frenoseguro.com', 1, '/uploads/companies/1/a1e48976457f04228ec2d696a7ca8984_300.png', '', '500 4500', '2011-10-28 15:40:15', 'Ecuador', 'Av. Dr. Juan Tanca Marengo Km. 5 1/2', 'Guayaquil', 'Guayas')
INSERT INTO `company_users` (`user_id`, `company_id`, `created_at`, `updated_at`) VALUES (1, 1, '2011-08-17 16:59:48', '2011-08-17 16:59:48')