app/controllers/customers_controller.rb

  def list_customers
    @company = Company.find(params[:company_id])
    @pagetitle = "#{@company.name} - Customers"

    if(@company.can_view(getUser()))
      if(params[:q] and params[:q] != "")
        fields = ["email", "name", "account"]

        q = params[:q].strip
        @q_org = q

        query = str_sql_search(q, fields)

        @customers = Customer.paginate(:page => params[:page], :order => 'name', :conditions => ["company_id = ? AND (#{query})", @company.id])
---
SELECT `companies`.* FROM `companies` WHERE `companies`.`id` = 1 LIMIT 1
SELECT `companies`.* FROM `companies` WHERE `companies`.`user_id` = 1 ORDER BY name
SELECT `customers`.* FROM `customers` WHERE `customers`.`company_id` = 1 ORDER BY name LIMIT 30 OFFSET 0

  def show
    @customer = Customer.find(params[:id])
---
SELECT `customers`.* FROM `customers` WHERE `customers`.`id` = 1 LIMIT 1

  def new
    @pagetitle = "New customer"

    @customer = Customer.new
    @customer[:taxable] = true
    @customer[:account] = "C_#{generate_guid()}"

    @company = Company.find(params[:company_id])
---
SELECT `companies`.* FROM `companies` WHERE `companies`.`id` = 1 LIMIT 1

  def create
    @pagetitle = "New customer"

    @customer = Customer.new(params[:customer])

    @company = Company.find(params[:customer][:company_id])

    respond_to do |format|
      if @customer.save
---
SELECT `companies`.* FROM `companies` WHERE `companies`.`id` = 1 LIMIT 1
INSERT INTO `customers` (`phone2`, `updated_at`, `company_id`, `country`, `state`, `address1`, `account`, `city`, `phone1`, `name`, `taxable`, `zip`, `created_at`, `email`, `address2`, `comments`) VALUES ('099434845', '2011-10-28 15:48:53', 1, 'Ecuador', 'Guayas', 'Ciudad Celeste', 'C_2660CE', 'Guayaquil', '6006894', 'David Jairala', '1', '5934', '2011-10-28 15:48:53', 'davidjairala@gmail.com', '', '')