app/controllers/invoices_controller.rb

SELECT `invoices`.* FROM `invoices` WHERE `invoices`.`id` = 2 LIMIT 1
---
  def pdf
    @invoice = Invoice.find(params[:id])

SELECT `companies`.* FROM `companies` WHERE `companies`.`id` = 1 LIMIT 1
SELECT `products`.* FROM `products` WHERE `products`.`id` = 3 LIMIT 1
---
  def list_items
    @company = Company.find(params[:company_id])
    items = params[:items]
    items = items.split(",")
    items_arr = []
    @products = []
    i = 0

    for item in items
      if item != ""
        parts = item.split("|BRK|")

        id = parts[0]
        quantity = parts[1]
        price = parts[2]
        discount = parts[3]

        product = Product.find(id.to_i)

SELECT `products`.* FROM `products` WHERE (company_id = '1' AND (code LIKE '%lla%' OR name LIKE '%lla%'))
---
  def ac_products
    @products = Product.find(:all, :conditions => ["company_id = ? AND (code LIKE ? OR name LIKE ?)", params[:company_id], "%" + params[:q] + "%", "%" + params[:q] + "%"])

SELECT `company_users`.* FROM `company_users` WHERE `company_users`.`company_id` = 1
SELECT `users`.* FROM `users` WHERE (id IN (1) AND (email LIKE '%mnygo%' OR username LIKE '%mnygo%'))
---
  def ac_user
    company_users = CompanyUser.find(:all, :conditions => {:company_id => params[:company_id]})

SELECT `customers`.* FROM `customers` WHERE (company_id = '1' AND (email LIKE '%dav%' OR name LIKE '%dav%'))
---
  def ac_customers
    @customers = Customer.find(:all, :conditions => ["company_id = ? AND (email LIKE ? OR name LIKE ?)", params[:company_id], "%" + params[:q] + "%", "%" + params[:q] + "%"])

SELECT `companies`.* FROM `companies` WHERE `companies`.`id` = 1 LIMIT 1
SELECT `locations`.* FROM `locations` WHERE `locations`.`company_id` = 1 ORDER BY name ASC
SELECT `divisions`.* FROM `divisions` WHERE `divisions`.`company_id` = 1 ORDER BY name ASC
SELECT `companies`.* FROM `companies` WHERE `companies`.`user_id` = 1 ORDER BY name
SELECT `customers`.* FROM `customers` WHERE `customers`.`company_id` = 1 LIMIT 1
SELECT `invoices`.* FROM `invoices` WHERE `invoices`.`company_id` = 1 ORDER BY id DESC LIMIT 20 OFFSET 0
---
  def list_invoices
    @company = Company.find(params[:company_id])
    @pagetitle = "#{@company.name} - Invoices"
    @filters_display = "block"

    @locations = Location.find(:all, :conditions => {:company_id => @company.id}, :order => "name ASC")
    @divisions = Division.find(:all, :conditions => {:company_id => @company.id}, :order => "name ASC")

    if(params[:location] and params[:location] != "")
      @sel_location = params[:location]
    end

    if(params[:division] and params[:division] != "")
      @sel_division = params[:division]
    end

    if(@company.can_view(getUser()))
      if(params[:ac_customer] and params[:ac_customer] != "")
        @customer = Customer.find(:first, :conditions => {:company_id => @company.id, :name => params[:ac_customer].strip})

        if @customer
          @invoices = Invoice.paginate(:page => params[:page], :conditions => {:company_id => @company.id, :customer_id => @customer.id}, :order => "id DESC")

SELECT `invoices`.* FROM `invoices` WHERE `invoices`.`id` = 1 LIMIT 1
---
  def show
    @invoice = Invoice.find(params[:id])

SELECT `companies`.* FROM `companies` WHERE `companies`.`id` = 1 LIMIT 1
---
  def new
    @pagetitle = "New invoice"
    @action_txt = "Create"

    @invoice = Invoice.new
    @invoice[:code] = "I_#{generate_guid()}"
    @invoice[:processed] = false

    @company = Company.find(params[:company_id])

SELECT `companies`.* FROM `companies` WHERE `companies`.`id` = 1 LIMIT 1
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
INSERT INTO `invoices` (`return`, `user_id`, `code`, `processed`, `date_processed`, `company_id`, `location_id`, `description`, `customer_id`, `created_at`, `subtotal`, `updated_at`, `total`, `comments`, `tax`, `division_id`) VALUES ('0', 1, 'I_F8A3BB', '1', NULL, 1, NULL, '', 1, '2012-01-26 23:58:27', 31.5, '2012-01-26 23:58:27', 35.28, '', 3.78, NULL)
---
  def create
    @pagetitle = "New invoice"
    @action_txt = "Create"

    items = params[:items].split(",")

    @invoice = Invoice.new(params[:invoice])

    @company = Company.find(params[:invoice][:company_id])

    @locations = @company.get_locations()
    @divisions = @company.get_divisions()

    @invoice[:subtotal] = @invoice.get_subtotal(items)

    begin
      @invoice[:tax] = @invoice.get_tax(items, @invoice[:customer_id])
    rescue
      @invoice[:tax] = 0
    end

    @invoice[:total] = @invoice[:subtotal] + @invoice[:tax]

    if(params[:invoice][:user_id] and params[:invoice][:user_id] != "")
      curr_seller = User.find(params[:invoice][:user_id])
      @ac_user = curr_seller.username
    end

    respond_to do |format|
      if @invoice.save