app/controllers/locations_controller.rb

SELECT `companies`.* FROM `companies` WHERE `companies`.`id` = 1 LIMIT 1
SELECT `companies`.* FROM `companies` WHERE `companies`.`user_id` = 1 ORDER BY name
SELECT `locations`.* FROM `locations` WHERE `locations`.`company_id` = 1 ORDER BY name
---
  def list_locations
    @company = Company.find(params[:company_id])
    @pagetitle = "#{@company.name} - Locations"

    if(@company.can_view(getUser()))
      @locations = Location.find(:all, :conditions => {:company_id => @company.id}, :order => "name")

SELECT `locations`.* FROM `locations` WHERE `locations`.`id` = 5 LIMIT 1
---
  def show
    @location = Location.find(params[:id])

SELECT `companies`.* FROM `companies` WHERE `companies`.`id` = 1 LIMIT 1
---
  def new
    @pagetitle = "New location"
    @location = Location.new
    @company = Company.find(params[:company_id])

SELECT `companies`.* FROM `companies` WHERE `companies`.`id` = 1 LIMIT 1
SELECT `locations`.* FROM `locations` WHERE `locations`.`company_id` = 1
INSERT INTO `locations` (`zip`, `created_at`, `website`, `updated_at`, `country`, `name`, `state`, `company_id`, `address2`, `phone2`, `phone1`, `city`, `address1`, `email`) VALUES ('5934', '2011-10-28 15:55:45', 'http://', '2011-10-28 15:55:45', 'Ecuador', 'Agencia Norte', 'Guayas', 1, '', '', '', 'Guayaquil', 'Av. Dr. Juan Tanca Marengo Km. 5 1/2', '')
---
  def create
    @pagetitle = "New location"
    @location = Location.new(params[:location])
    @company = Company.find(params[:location][:company_id])

    @locations_left_i = getUser().locations_left
    @locations_left = getUser().print_locations_left
    @locations_left_class = getUser().locations_left_class

    # Check package limits
    if(@locations_left_i <= 0 and @locations_left_i > -1000)
      flash[:error] = "You have created the most locations you can within your package.  Please select another package to create more locations."
      redirect_to("/pricing")
    else
      # Check if the user can use the company
      if(not @company.can_view(getUser()))
        redirect_to '/err_perms'
      else
        respond_to do |format|
          if @location.save

SELECT `locations`.* FROM `locations` WHERE `locations`.`id` = 2 LIMIT 1
DELETE FROM `locations` WHERE `locations`.`id` = 2
---
  def destroy
    @location = Location.find(params[:id])
    company_id = @location[:company_id]
    @location.destroy