app/controllers/packages_controller.rb

SELECT `packages`.* FROM `packages`
---
  def index
    @pagetitle = "Packages"
    @packages = Package.all

SELECT `packages`.* FROM `packages` WHERE `packages`.`id` = 2 LIMIT 1
---
  def show
    @package = Package.find(params[:id])

INSERT INTO `packages` (`slug`, `users`, `description`, `title`, `price`, `companies`, `locations`, `updated_at`, `created_at`) VALUES ('full_package', -1000, 'The whole thing!', 'Full Package', 1000.0, -1000, -1000, '2011-10-28 16:01:54', '2011-10-28 16:01:54')
---
  def create
    @pagetitle = "New package"
    @package = Package.new(params[:package])
    @package[:slug] = @package[:title].to_slug

    respond_to do |format|
      if @package.save