app/controllers/pages_controller.rb

  def dashboard
    @pagetitle = "Dashboard"

    if(not isLogged())
      flash[:error] = 'You must sign up and log in to view your dashboard.'
      redirect_to '/login?next=dashboard'
    else
      @pagetitle = 'Dashboard'
      @user_package = UsersPackage.find(:first, :conditions => {:user_id => getUserId()})
---
SELECT `packages`.* FROM `packages` WHERE `packages`.`id` = 1 LIMIT 1
SELECT `users_packages`.* FROM `users_packages` WHERE `users_packages`.`user_id` = 1 LIMIT 1