app/controllers/products_kits_controller.rb

  def list_products_kits
    @company = Company.find(params[:company_id])
    @pagetitle = "#{@company.name} - Product kits"

    if(@company.can_view(getUser()))
      @products_kits = ProductsKit.paginate(:page => params[:page], :order => 'name', :conditions => {:company_id => @company.id})
---
SELECT `companies`.* FROM `companies` WHERE `companies`.`id` = 1 LIMIT 1
SELECT `companies`.* FROM `companies` WHERE `companies`.`user_id` = 1 ORDER BY name
SELECT `products_kits`.* FROM `products_kits` WHERE `products_kits`.`company_id` = 1 ORDER BY name LIMIT 30 OFFSET 0

  def new
    @pagetitle = "New product kit"

    @action = "Create"

    @company = Company.find(params[:company_id])
---
SELECT `companies`.* FROM `companies` WHERE `companies`.`id` = 1 LIMIT 1