app/controllers/products_controller.rb

SELECT `products_categories`.* FROM `products_categories` WHERE (company_id = '1' AND category LIKE '%bandas%')
---
  def ac_categories
    @categories = ProductsCategory.find(:all, :conditions => ["company_id = ? AND category LIKE ?", params[:company_id], "%" + params[:q] + "%"])

SELECT `companies`.* FROM `companies` WHERE `companies`.`id` = 1 LIMIT 1
SELECT `companies`.* FROM `companies` WHERE `companies`.`user_id` = 1 ORDER BY name
SELECT `products`.* FROM `products` WHERE (company_id = 1 AND (((name LIKE "%banda%")) OR ((code LIKE "%banda%")) OR ((category LIKE "%banda%")) OR ((description LIKE "%banda%")) OR ((comments LIKE "%banda%")))) ORDER BY name LIMIT 20 OFFSET 0
---
  def list_products
    @company = Company.find(params[:company_id])
    @pagetitle = "#{@company.name} - Products"

    if(@company.can_view(getUser()))
      if(params[:restock])
        @products = Product.paginate(:page => params[:page], :order => 'name', :conditions => ["company_id = ? AND quantity <= reorder", @company.id])

SELECT `companies`.* FROM `companies` WHERE `companies`.`id` = 1 LIMIT 1
---
  def new
    @pagetitle = "New product"

    @product = Product.new
    @product[:cost] = 0
    @product[:company_id] = params[:company_id]
    @company = Company.find(params[:company_id])

SELECT `products`.* FROM `products` WHERE `products`.`id` = 1 LIMIT 1
---
  def edit
    @pagetitle = "Edit product"

    @product = Product.find(params[:id])

SELECT `companies`.* FROM `companies` WHERE `companies`.`id` = 1 LIMIT 1
INSERT INTO `products` (`category`, `tax2`, `description`, `code`, `quantity`, `name`, `updated_at`, `cost`, `price`, `company_id`, `comments`, `created_at`, `tax3`, `tax1_name`, `supplier_id`, `reorder`, `tax1`, `tax2_name`, `tax3_name`) VALUES ('Bandas', 0.0, 'La continúa investigación y desarrollo es la única manera de mantenerse al veloz paso de la cambiante tecnología automotriz e industrial. Para ello Gates ha instalado decenas de plantas alrededor del mundo, a fin de trabajar en conjunto con los equipos de ingenieros de las diferentes casas fabricantes de equipo original, a quienes se provee de productos Gates para tal equipo.', 'banda_gate_001', 100, 'Banda Gate', '2011-10-28 15:42:11', 40.0, 60.0, 1, '', '2011-10-28 15:42:11', 0.0, 'IVA', NULL, 10, 15.0, '', '')
---
  def create
    @pagetitle = "New product"

    @product = Product.new(params[:product])
    @company = Company.find(params[:product][:company_id])
    @suppliers = @company.get_suppliers()

    if(@product[:tax1] == nil)
      @product[:tax1] = 0
    end

    if(@product[:tax2] == nil)
      @product[:tax2] = 0
    end

    if(@product[:tax3] == nil)
      @product[:tax3] = 0
    end

    if(@company.can_view(getUser()))
      respond_to do |format|
        if @product.save

SELECT `products`.* FROM `products` WHERE `products`.`id` = 1 LIMIT 1
UPDATE `products` SET `updated_at` = '2011-10-28 15:45:38', `supplier_id` = 3 WHERE `products`.`id` = 3
---
  def update
    @pagetitle = "Edit product"

    @product = Product.find(params[:id])
    @company = @product.company
    @suppliers = @company.get_suppliers()

    respond_to do |format|
      if @product.update_attributes(params[:product])