app/controllers/reports_controller.rb

SELECT `companies`.* FROM `companies` WHERE `companies`.`id` = 1 LIMIT 1
---
  def monthly_profits
    @company = Company.find(params[:company_id])

SELECT `companies`.* FROM `companies` WHERE `companies`.`id` = 1 LIMIT 1
---
  def profits
    @company = Company.find(params[:company_id])

SELECT `companies`.* FROM `companies` WHERE `companies`.`id` = 1 LIMIT 1
SELECT `locations`.* FROM `locations` WHERE `locations`.`id` = 5 LIMIT 1
---
  def report_view_monthly_locations
    @company = Company.find(params[:company_id])
    @location = Location.find(params[:location_id])

SELECT `companies`.* FROM `companies` WHERE `companies`.`id` = 1 LIMIT 1
---
  def report_monthly_locations
    @company = Company.find(params[:company_id])

SELECT `companies`.* FROM `companies` WHERE `companies`.`id` = 1 LIMIT 1
---
  def report_locations
    @company = Company.find(params[:company_id])

SELECT `companies`.* FROM `companies` WHERE `companies`.`id` = 1 LIMIT 1
SELECT `customers`.* FROM `customers` WHERE `customers`.`id` = 1 LIMIT 1
---
  def report_view_monthly_customers
    @company = Company.find(params[:company_id])
    @customer = Customer.find(params[:customer_id])

SELECT `companies`.* FROM `companies` WHERE `companies`.`id` = 1 LIMIT 1
---
  def report_monthly_customers
    @company = Company.find(params[:company_id])

SELECT `companies`.* FROM `companies` WHERE `companies`.`id` = 1 LIMIT 1
---
  def report_customers
    @company = Company.find(params[:company_id])

SELECT `companies`.* FROM `companies` WHERE `companies`.`id` = 1 LIMIT 1
SELECT `products`.* FROM `products` WHERE `products`.`id` = 4 LIMIT 1
---
  def report_view_monthly_products
    @company = Company.find(params[:company_id])
    @product = Product.find(params[:product_id])

SELECT `companies`.* FROM `companies` WHERE `companies`.`id` = 1 LIMIT 1
---
  def report_monthly_products
    @company = Company.find(params[:company_id])

SELECT `companies`.* FROM `companies` WHERE `companies`.`id` = 1 LIMIT 1
---
  def report_products
    @company = Company.find(params[:company_id])

SELECT `companies`.* FROM `companies` WHERE `companies`.`id` = 1 LIMIT 1
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
---
  def report_view_monthly_sellers
    @company = Company.find(params[:company_id])
    @user = User.find(params[:user_id])

SELECT `companies`.* FROM `companies` WHERE `companies`.`id` = 1 LIMIT 1
---
  def report_monthly_sellers
    @company = Company.find(params[:company_id])

SELECT `companies`.* FROM `companies` WHERE `companies`.`id` = 1 LIMIT 1
---
  def report_sellers
    @company = Company.find(params[:company_id])

SELECT `companies`.* FROM `companies` WHERE `companies`.`id` = 1 LIMIT 1
---
  def report_sales
    @company = Company.find(params[:company_id])

SELECT `companies`.* FROM `companies` WHERE `companies`.`id` = 1 LIMIT 1
---
  def reports
    @company = Company.find(params[:company_id])