app/controllers/suppliers_controller.rb

  def list_suppliers
    @company = Company.find(params[:company_id])
    @pagetitle = "#{@company.name} - Suppliers"

    if(@company.can_view(getUser()))
      if(params[:q] and params[:q] != "")
        fields = ["email", "name"]

        q = params[:q].strip
        @q_org = q

        query = str_sql_search(q, fields)

        @suppliers = Supplier.paginate(:page => params[:page], :order => 'name', :conditions => ["company_id = ? AND (#{query})", @company.id])
---
SELECT `companies`.* FROM `companies` WHERE `companies`.`id` = 1 LIMIT 1
SELECT `companies`.* FROM `companies` WHERE `companies`.`user_id` = 1 ORDER BY name
SELECT `suppliers`.* FROM `suppliers` WHERE `suppliers`.`company_id` = 1 ORDER BY name LIMIT 30 OFFSET 0

  def show
    @supplier = Supplier.find(params[:id])
---
SELECT `suppliers`.* FROM `suppliers` WHERE `suppliers`.`id` = 1 LIMIT 1

  def new
    @pagetitle = "New supplier"

    if(params[:company_id])
      @company = Company.find(params[:company_id])
---
SELECT `companies`.* FROM `companies` WHERE `companies`.`id` = 1 LIMIT 1

  def create
    @pagetitle = "New supplier"

    @company = Company.find(params[:supplier][:company_id])
    @supplier = Supplier.new(params[:supplier])

    respond_to do |format|
      if @supplier.save
---
SELECT `companies`.* FROM `companies` WHERE `companies`.`id` = 1 LIMIT 1
INSERT INTO `suppliers` (`email`, `updated_at`, `company_id`, `address2`, `phone2`, `phone1`, `country`, `created_at`, `zip`, `address1`, `state`, `city`, `comments`, `name`) VALUES ('info@goodrich.com', '2011-10-28 15:46:46', 1, '', '', '', '', '2011-10-28 15:46:46', '', '', '', '', '', 'B.F. Goodrich')