app/controllers/users_controller.rb

SELECT `users`.* FROM `users` WHERE (username = 'mnygo' AND password = 'e1b8542010a5bf2744cf2e8402abf280') LIMIT 1
---
  def login
    require "digest"

    @pagetitle = "Login"

    if params[:next]
      @next = params[:next]
    end

    if params[:user]
      @user = User.find(:first, :conditions => ["username = ? AND password = ?", params[:user][:username], Digest::MD5.hexdigest(getSalt() + params[:user][:password])])

SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
---
  def show
    @pagetitle = "View user"

    @user = User.find(params[:id])